eisup_2019_docmng_integration/src/Catalogs/абс_ПоказателиДляПремий/абс_ПоказателиДляПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ПоказателиДляПремий</name>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателейСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.абс_ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстМодуля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыполнения</name>
    <type>
      <types>EnumRef.абс_ВидыВыполненияМодулей</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПоследнийИзменивший</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяКПЭ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитикиКПЭ</name>
    <type>
      <types>EnumRef.абс_ВидыАналитикиЗначенийПоказателейКПЭ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаКПЭ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоВыражение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запросы</name>
    <attributes>
      <name>ИмяЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстЗапроса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Enums/абс_ВидыПоказателей/абс_ВидыПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыПоказателей</name>
  <enumValues>
    <name>Алгоритмом</name>
  </enumValues>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/абс_ПоказателиДляПремий/Forms/ФормаЭлементаУправляемая/Module.bsl
&НаКлиенте
Процедура ВидПоказателяПриИзменении(Элемент)
	Элементы.АлгоритмРасчета.Видимость = Объект.ТипПоказателя = Перечисления.абс_ВидыПоказателей.Алгоритмом;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТолькоПросмотр = Истина;
	
	Элементы.АлгоритмРасчета.Видимость = Объект.ТипПоказателя = Перечисления.абс_ВидыПоказателей.Алгоритмом;
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмРасчетаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбщаяФорма = ПолучитьОбщуюФорму("ВводТекста", ЭтаФорма);
	ОбщаяФорма.Текст = Объект.ТекстМодуля;
	ОбщаяФорма.ОткрытьМодально();
	Если Объект.ТекстМодуля <> ОбщаяФорма.Текст Тогда 
		Объект.ТекстМодуля = ОбщаяФорма.Текст;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ПолучитьИдентификатор(Элемент.ТекстРедактирования, Объект.Идентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписанНовыйПоказатель");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИдентификатор(СтрНаименование, Идентификатор)
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Разделители	=  " .,+,-,/,*,?,=,<,>,(,)%!@#$%&*""№:;{}[]?()\|/`~'^_";
		
		Идентификатор = "";
		БылСпецСимвол = Ложь;
		Для НомСимвола = 1 По СтрДлина(СтрНаименование) Цикл
			Символ = Сред(СтрНаименование,НомСимвола,1);
			Если Найти(Разделители, Символ) <> 0 Тогда
				БылСпецСимвол = Истина;
			ИначеЕсли БылСпецСимвол Тогда
				БылСпецСимвол = Ложь;
				Идентификатор = Идентификатор + ВРег(Символ);
			Иначе
				Идентификатор = Идентификатор + Символ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //ПолучитьИдентификатор

&НаКлиенте
Процедура ПроверитьАлгоритм(Команда)
	Если Модифицированность Тогда 
		Ответ = Вопрос("Перед проверкой элемент необходимо записать. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			Записать();
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Работает = ПроверитьАлгоритмНаСервере();
	Если Работает Тогда 
		Элементы.ПроверитьАлгоритм.Картинка = БиблиотекаКартинок.ЗеленаяГалка;
	Иначе 
		Элементы.ПроверитьАлгоритм.Картинка = БиблиотекаКартинок.ПротоколСОшибкой;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьАлгоритмНаСервере()
	Возврат Справочники.абс_ПоказателиДляПремий.ПроверитьАлгоритм(Объект.Ссылка);
КонецФункции
